Tekla Open API Reference for Tekla Structures 2025
MarkBase.MarkBaseAttributes.Angle Property
 The actual angle of the mark, in degrees. Can differ from the rotation angle set by the user for marks, e.g. 45-degree column marks in GA drawings or when placing mark along part edges.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Angle { get; }
Public ReadOnly Property Angle As Double
	Get
Property Value
Type: Double
See Also
Reference
MarkBase.MarkBaseAttributes Class
Tekla.Structures.Drawing Namespace